Revit 2027 API
SpecTypeId.ElectricalPower Property
 Power, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElectricalPower { get; }
Public Shared ReadOnly Property ElectricalPower As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElectricalPower {
	ForgeTypeId^ get ();
}
static member ElectricalPower : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace